In [1]:
import pandas as pd

# Read Titanic dataset using Pandas
titanic_data = pd.read_csv('titanic_numpy.csv')

# Convert Pandas DataFrame to NumPy array
titanic_array = titanic_data.values

In [2]:
import numpy as np

In [3]:
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
titanic_array

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

1) Type Conversion in NumPy Arrays:\
Question: Convert the 'Age' column of the Titanic dataset to a NumPy array with float data type.
Solution

In [5]:
titanic_array.shape # Shape of the array

(891, 12)

In [6]:
titanic_array_T = titanic_array.T

In [7]:
age = titanic_array_T[5].astype('float64')

In [8]:
age.dtype

dtype('float64')

2) Indexing & Slicing:\
Question: Print the details of passengers with passenger ID 10 to 20.

In [9]:
titanic_array[9:20]

array([[10, 1, 2, 'Nasser, Mrs. Nicholas (Adele Achem)', 'female', 14.0,
        1, 0, '237736', 30.0708, nan, 'C'],
       [11, 1, 3, 'Sandstrom, Miss. Marguerite Rut', 'female', 4.0, 1, 1,
        'PP 9549', 16.7, 'G6', 'S'],
       [12, 1, 1, 'Bonnell, Miss. Elizabeth', 'female', 58.0, 0, 0,
        '113783', 26.55, 'C103', 'S'],
       [13, 0, 3, 'Saundercock, Mr. William Henry', 'male', 20.0, 0, 0,
        'A/5. 2151', 8.05, nan, 'S'],
       [14, 0, 3, 'Andersson, Mr. Anders Johan', 'male', 39.0, 1, 5,
        '347082', 31.275, nan, 'S'],
       [15, 0, 3, 'Vestrom, Miss. Hulda Amanda Adolfina', 'female', 14.0,
        0, 0, '350406', 7.8542, nan, 'S'],
       [16, 1, 2, 'Hewlett, Mrs. (Mary D Kingcome) ', 'female', 55.0, 0,
        0, '248706', 16.0, nan, 'S'],
       [17, 0, 3, 'Rice, Master. Eugene', 'male', 2.0, 4, 1, '382652',
        29.125, nan, 'Q'],
       [18, 1, 2, 'Williams, Mr. Charles Eugene', 'male', nan, 0, 0,
        '244373', 13.0, nan, 'S'],
       [19, 0, 3,
        'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)',
        'female', 31.0, 1, 0, '345763', 18.0, nan, 'S'],
       [20, 1, 3, 'Masselmani, Mrs. Fatima', 'female', nan, 0, 0, '2649',
        7.225, nan, 'C']], dtype=object)

In [10]:
titanic_array[(titanic_array[:,0] >= 10) & (titanic_array[:,0] <=20)] # Using Fancy INdexing

array([[10, 1, 2, 'Nasser, Mrs. Nicholas (Adele Achem)', 'female', 14.0,
        1, 0, '237736', 30.0708, nan, 'C'],
       [11, 1, 3, 'Sandstrom, Miss. Marguerite Rut', 'female', 4.0, 1, 1,
        'PP 9549', 16.7, 'G6', 'S'],
       [12, 1, 1, 'Bonnell, Miss. Elizabeth', 'female', 58.0, 0, 0,
        '113783', 26.55, 'C103', 'S'],
       [13, 0, 3, 'Saundercock, Mr. William Henry', 'male', 20.0, 0, 0,
        'A/5. 2151', 8.05, nan, 'S'],
       [14, 0, 3, 'Andersson, Mr. Anders Johan', 'male', 39.0, 1, 5,
        '347082', 31.275, nan, 'S'],
       [15, 0, 3, 'Vestrom, Miss. Hulda Amanda Adolfina', 'female', 14.0,
        0, 0, '350406', 7.8542, nan, 'S'],
       [16, 1, 2, 'Hewlett, Mrs. (Mary D Kingcome) ', 'female', 55.0, 0,
        0, '248706', 16.0, nan, 'S'],
       [17, 0, 3, 'Rice, Master. Eugene', 'male', 2.0, 4, 1, '382652',
        29.125, nan, 'Q'],
       [18, 1, 2, 'Williams, Mr. Charles Eugene', 'male', nan, 0, 0,
        '244373', 13.0, nan, 'S'],
       [19, 0, 3,
        'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)',
        'female', 31.0, 1, 0, '345763', 18.0, nan, 'S'],
       [20, 1, 3, 'Masselmani, Mrs. Fatima', 'female', nan, 0, 0, '2649',
        7.225, nan, 'C']], dtype=object)

3) Fancy Indexing:\
Question: Print the details of passengers with odd passenger IDs.

In [11]:
#titanic_array[:,0] % 2 == 0

In [12]:
titanic_array[titanic_array[:,0] % 2 == 1]

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       [5, 0, 3, ..., 8.05, nan, 'S'],
       ...,
       [887, 0, 2, ..., 13.0, nan, 'S'],
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

4) 2D Indexing:\
Question: Print the details of passengers in the 3rd row.

5) Masking:\
Question: Print the details of passengers with 'Fare' greater than 100.

In [13]:
#titanic_data

In [14]:
titanic_array[titanic_array[:,9] > 100]

array([[28, 0, 1, 'Fortune, Mr. Charles Alexander', 'male', 19.0, 3, 2,
        '19950', 263.0, 'C23 C25 C27', 'S'],
       [32, 1, 1, 'Spencer, Mrs. William Augustus (Marie Eugenie)',
        'female', nan, 1, 0, 'PC 17569', 146.5208, 'B78', 'C'],
       [89, 1, 1, 'Fortune, Miss. Mabel Helen', 'female', 23.0, 3, 2,
        '19950', 263.0, 'C23 C25 C27', 'S'],
       [119, 0, 1, 'Baxter, Mr. Quigg Edmond', 'male', 24.0, 0, 1,
        'PC 17558', 247.5208, 'B58 B60', 'C'],
       [196, 1, 1, 'Lurette, Miss. Elise', 'female', 58.0, 0, 0,
        'PC 17569', 146.5208, 'B80', 'C'],
       [216, 1, 1, 'Newell, Miss. Madeleine', 'female', 31.0, 1, 0,
        '35273', 113.275, 'D36', 'C'],
       [259, 1, 1, 'Ward, Miss. Anna', 'female', 35.0, 0, 0, 'PC 17755',
        512.3292, nan, 'C'],
       [269, 1, 1, 'Graham, Mrs. William Thompson (Edith Junkins)',
        'female', 58.0, 0, 1, 'PC 17582', 153.4625, 'C125', 'S'],
       [270, 1, 1, 'Bissette, Miss. Amelia', 'female', 35.0, 0, 0,
        'PC 17760', 135.6333, 'C99', 'S'],
       [298, 0, 1, 'Allison, Miss. Helen Loraine', 'female', 2.0, 1, 2,
        '113781', 151.55, 'C22 C26', 'S'],
       [300, 1, 1, 'Baxter, Mrs. James (Helene DeLaudeniere Chaput)',
        'female', 50.0, 0, 1, 'PC 17558', 247.5208, 'B58 B60', 'C'],
       [306, 1, 1, 'Allison, Master. Hudson Trevor', 'male', 0.92, 1, 2,
        '113781', 151.55, 'C22 C26', 'S'],
       [307, 1, 1, 'Fleming, Miss. Margaret', 'female', nan, 0, 0,
        '17421', 110.8833, nan, 'C'],
       [308, 1, 1,
        'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)',
        'female', 17.0, 1, 0, 'PC 17758', 108.9, 'C65', 'C'],
       [312, 1, 1, 'Ryerson, Miss. Emily Borie', 'female', 18.0, 2, 2,
        'PC 17608', 262.375, 'B57 B59 B63 B66', 'C'],
       [319, 1, 1, 'Wick, Miss. Mary Natalie', 'female', 31.0, 0, 2,
        '36928', 164.8667, 'C7', 'S'],
       [320, 1, 1,
        'Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)',
        'female', 40.0, 1, 1, '16966', 134.5, 'E34', 'C'],
       [326, 1, 1, 'Young, Miss. Marie Grice', 'female', 36.0, 0, 0,
        'PC 17760', 135.6333, 'C32', 'C'],
       [333, 0, 1, 'Graham, Mr. George Edward', 'male', 38.0, 0, 1,
        'PC 17582', 153.4625, 'C91', 'S'],
       [335, 1, 1, 'Frauenthal, Mrs. Henry William (Clara Heinsheimer)',
        'female', nan, 1, 0, 'PC 17611', 133.65, nan, 'S'],
       [338, 1, 1, 'Burns, Miss. Elizabeth Margaret', 'female', 41.0, 0,
        0, '16966', 134.5, 'E40', 'C'],
       [342, 1, 1, 'Fortune, Miss. Alice Elizabeth', 'female', 24.0, 3,
        2, '19950', 263.0, 'C23 C25 C27', 'S'],
       [374, 0, 1, 'Ringhini, Mr. Sante', 'male', 22.0, 0, 0, 'PC 17760',
        135.6333, nan, 'C'],
       [378, 0, 1, 'Widener, Mr. Harry Elkins', 'male', 27.0, 0, 2,
        '113503', 211.5, 'C82', 'C'],
       [381, 1, 1, 'Bidois, Miss. Rosalie', 'female', 42.0, 0, 0,
        'PC 17757', 227.525, nan, 'C'],
       [391, 1, 1, 'Carter, Mr. William Ernest', 'male', 36.0, 1, 2,
        '113760', 120.0, 'B96 B98', 'S'],
       [394, 1, 1, 'Newell, Miss. Marjorie', 'female', 23.0, 1, 0,
        '35273', 113.275, 'D36', 'C'],
       [436, 1, 1, 'Carter, Miss. Lucile Polk', 'female', 14.0, 1, 2,
        '113760', 120.0, 'B96 B98', 'S'],
       [439, 0, 1, 'Fortune, Mr. Mark', 'male', 64.0, 1, 4, '19950',
        263.0, 'C23 C25 C27', 'S'],
       [499, 0, 1, 'Allison, Mrs. Hudson J C (Bessie Waldo Daniels)',
        'female', 25.0, 1, 2, '113781', 151.55, 'C22 C26', 'S'],
       [506, 0, 1, 'Penasco y Castellana, Mr. Victor de Satode', 'male',
        18.0, 1, 0, 'PC 17758', 108.9, 'C65', 'C'],
       [528, 0, 1, 'Farthing, Mr. John', 'male', nan, 0, 0, 'PC 17483',
        221.7792, 'C95', 'S'],
       [538, 1, 1, 'LeRoy, Miss. Bertha', 'female', 30.0, 0, 0,
        'PC 17761', 106.425, nan, 'C'],
       [545, 0, 1, 'Douglas, Mr. Walter Donald', 'male', 50.0, 1, 0,
        'PC 17761', 106.425, 'C86', 'C'],
       [551, 1, 1, 'Thayer, Mr. John Borland Jr', 'male', 17.0, 0, 2,
        '17421', 110.8833, 'C70', 'C'],
       [558, 0, 1, 'Robbins, Mr. Victor', 'male', nan, 0, 0, 'PC 17757',
        227.525, nan, 'C'],
       [582, 1, 1,
        'Thayer, Mrs. John Borland (Marian Longstreth Morris)', 'female',
        39.0, 1, 1, '17421', 110.8833, 'C68', 'C'],
       [610, 1, 1, 'Shutes, Miss. Elizabeth W', 'female', 40.0, 0, 0,
        'PC 17582', 153.4625, 'C125', 'S'],
       [660, 0, 1, 'Newell, Mr. Arthur Webster', 'male', 58.0, 0, 2,
        '35273', 113.275, 'D48', 'C'],
       [661, 1, 1, 'Frauenthal, Dr. Henry William', 'male', 50.0, 2, 0,
        'PC 17611', 133.65, nan, 'S'],
       [680, 1, 1, 'Cardeza, Mr. Thomas Drake Martinez', 'male', 36.0, 0,
        1, 'PC 17755', 512.3292, 'B51 B53 B55', 'C'],
       [690, 1, 1, 'Madill, Miss. Georgette Alexandra', 'female', 15.0,
        0, 1, '24160', 211.3375, 'B5', 'S'],
       [699, 0, 1, 'Thayer, Mr. John Borland', 'male', 49.0, 1, 1,
        '17421', 110.8833, 'C68', 'C'],
       [701, 1, 1, 'Astor, Mrs. John Jacob (Madeleine Talmadge Force)',
        'female', 18.0, 1, 0, 'PC 17757', 227.525, 'C62 C64', 'C'],
       [709, 1, 1, 'Cleaver, Miss. Alice', 'female', 22.0, 0, 0,
        '113781', 151.55, nan, 'S'],
       [717, 1, 1, 'Endres, Miss. Caroline Louise', 'female', 38.0, 0, 0,
        'PC 17757', 227.525, 'C45', 'C'],
       [731, 1, 1, 'Allen, Miss. Elisabeth Walton', 'female', 29.0, 0, 0,
        '24160', 211.3375, 'B5', 'S'],
       [738, 1, 1, 'Lesurer, Mr. Gustave J', 'male', 35.0, 0, 0,
        'PC 17755', 512.3292, 'B101', 'C'],
       [743, 1, 1, 'Ryerson, Miss. Susan Parker "Suzette"', 'female',
        21.0, 2, 2, 'PC 17608', 262.375, 'B57 B59 B63 B66', 'C'],
       [764, 1, 1, 'Carter, Mrs. William Ernest (Lucile Polk)', 'female',
        36.0, 1, 2, '113760', 120.0, 'B96 B98', 'S'],
       [780, 1, 1,
        'Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)',
        'female', 43.0, 0, 1, '24160', 211.3375, 'B3', 'S'],
       [803, 1, 1, 'Carter, Master. William Thornton II', 'male', 11.0,
        1, 2, '113760', 120.0, 'B96 B98', 'S'],
       [857, 1, 1, 'Wick, Mrs. George Dennick (Mary Hitchcock)',
        'female', 45.0, 1, 1, '36928', 164.8667, nan, 'S']], dtype=object)

There are total of 53 passengers with Fare greater than 100

6) np.all:\
Question: Check if all 'Fare' values are greater than 0.

In [15]:
np.all(titanic_array[:,9] > 0)

False

7. np.where:\
Question: Find the indices where 'Survived' column is equal to 1.

In [16]:
np.where(titanic_array[:,1] == 1)

(array([  1,   2,   3,   8,   9,  10,  11,  15,  17,  19,  21,  22,  23,
         25,  28,  31,  32,  36,  39,  43,  44,  47,  52,  53,  55,  56,
         58,  61,  65,  66,  68,  74,  78,  79,  81,  82,  84,  85,  88,
         97,  98, 106, 107, 109, 123, 125, 127, 128, 133, 136, 141, 142,
        146, 151, 156, 161, 165, 166, 172, 183, 184, 186, 187, 190, 192,
        193, 194, 195, 198, 204, 207, 208, 209, 211, 215, 216, 218, 220,
        224, 226, 230, 233, 237, 241, 247, 248, 255, 256, 257, 258, 259,
        261, 267, 268, 269, 271, 272, 274, 275, 279, 283, 286, 288, 289,
        290, 291, 298, 299, 300, 301, 303, 305, 306, 307, 309, 310, 311,
        315, 316, 318, 319, 322, 323, 325, 327, 328, 329, 330, 334, 337,
        338, 340, 341, 345, 346, 347, 348, 356, 358, 359, 366, 367, 368,
        369, 370, 375, 376, 380, 381, 383, 387, 389, 390, 391, 393, 394,
        399, 400, 407, 412, 414, 416, 417, 426, 427, 429, 430, 431, 432,
        435, 437, 440, 443, 444, 445, 446, 447, 448, 449, 453, 455, 457,
        458, 460, 469, 472, 473, 479, 483, 484, 486, 489, 496, 504, 506,
        507, 509, 510, 512, 513, 516, 518, 520, 523, 526, 530, 533, 535,
        537, 539, 540, 543, 546, 547, 549, 550, 553, 554, 556, 558, 559,
        569, 570, 571, 572, 573, 576, 577, 579, 580, 581, 585, 587, 591,
        596, 599, 600, 604, 607, 608, 609, 612, 615, 618, 621, 622, 627,
        630, 632, 635, 641, 643, 644, 645, 647, 649, 651, 653, 660, 664,
        669, 670, 673, 677, 679, 681, 689, 690, 691, 692, 697, 700, 701,
        706, 707, 708, 709, 710, 712, 716, 717, 720, 724, 726, 727, 730,
        737, 740, 742, 744, 747, 750, 751, 754, 755, 759, 762, 763, 765,
        774, 777, 779, 780, 781, 786, 788, 796, 797, 801, 802, 803, 804,
        809, 820, 821, 823, 827, 828, 829, 830, 831, 835, 838, 839, 842,
        849, 853, 855, 856, 857, 858, 862, 865, 866, 869, 871, 874, 875,
        879, 880, 887, 889]),)

8. np.any:\
Question: Check if any 'Age' value is missing (NaN).

In [17]:
np.any(np.isnan(titanic_array[:,5].astype('float64')))

True

9. Sorting:\
Question: Sort the Titanic array based on 'Fare' column in descending order.

In [18]:
titanic_fare_sort = titanic_array[np.argsort(titanic_array[:,9])[::-1]]
titanic_fare_sort

array([[680, 1, 1, ..., 512.3292, 'B51 B53 B55', 'C'],
       [259, 1, 1, ..., 512.3292, nan, 'C'],
       [738, 1, 1, ..., 512.3292, 'B101', 'C'],
       ...,
       [303, 0, 3, ..., 0.0, nan, 'S'],
       [598, 0, 3, ..., 0.0, nan, 'S'],
       [272, 1, 3, ..., 0.0, nan, 'S']], dtype=object)

10. Matrix Multiplication:\
Question: Find the dot product of 'Age' and 'Fare' columns.

In [19]:
age = titanic_array_T[5].astype('float64')
fare = titanic_array_T[9].astype('float64')
age.shape, fare.shape

((891,), (891,))

In [20]:
np.dot(titanic_array[:,5], titanic_array[:,9])

nan

In [21]:
np.dot(age, fare)

nan

### When NaN is replaced with 0

In [22]:
age = np.where(np.isnan(age), 0, age)
fare = np.where(np.isnan(fare), 0, fare)
np.dot(age, fare)

788357.425814

11. Broadcasting:\
Question: Multiply 'Fare' column by 2 and add 10 to each element.

In [23]:
fare[:5]

array([ 7.25  , 71.2833,  7.925 , 53.1   ,  8.05  ])

In [24]:
new_fare = (fare * 2) + 10
new_fare[:5]

array([ 24.5   , 152.5666,  25.85  , 116.2   ,  26.1   ])

12. Shallow vs Deep Copy:\
Question: Create a shallow copy of the Titanic array and modify a value. Check if the original array is affected.

In [25]:
# Creating a view
titanic_view = titanic_array.view()
titanic_view[:5]

array([[1, 0, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0,
        'A/5 21171', 7.25, nan, 'S'],
       [2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
        'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C'],
       [3, 1, 3, 'Heikkinen, Miss. Laina', 'female', 26.0, 0, 0,
        'STON/O2. 3101282', 7.925, nan, 'S'],
       [4, 1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
        'female', 35.0, 1, 0, '113803', 53.1, 'C123', 'S'],
       [5, 0, 3, 'Allen, Mr. William Henry', 'male', 35.0, 0, 0,
        '373450', 8.05, nan, 'S']], dtype=object)

In [26]:
# Updating Survived to 1 for 1st record
titanic_view[0][1] = 1

In [27]:
titanic_view[:5] # Checking view after update

array([[1, 1, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0,
        'A/5 21171', 7.25, nan, 'S'],
       [2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
        'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C'],
       [3, 1, 3, 'Heikkinen, Miss. Laina', 'female', 26.0, 0, 0,
        'STON/O2. 3101282', 7.925, nan, 'S'],
       [4, 1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
        'female', 35.0, 1, 0, '113803', 53.1, 'C123', 'S'],
       [5, 0, 3, 'Allen, Mr. William Henry', 'male', 35.0, 0, 0,
        '373450', 8.05, nan, 'S']], dtype=object)

In [28]:
titanic_array[:5] # Checking original array

array([[1, 1, 3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0,
        'A/5 21171', 7.25, nan, 'S'],
       [2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
        'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C'],
       [3, 1, 3, 'Heikkinen, Miss. Laina', 'female', 26.0, 0, 0,
        'STON/O2. 3101282', 7.925, nan, 'S'],
       [4, 1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
        'female', 35.0, 1, 0, '113803', 53.1, 'C123', 'S'],
       [5, 0, 3, 'Allen, Mr. William Henry', 'male', 35.0, 0, 0,
        '373450', 8.05, nan, 'S']], dtype=object)

13. Array Splitting:\
Question: Split the Titanic array into two arrays horizontally.

In [30]:
titanic_array.shape
#np.vsplit(titanic_array, 2)

(891, 12)

In [31]:
np.array_split(titanic_array, 2)

[array([[1, 1, 3, ..., 7.25, nan, 'S'],
        [2, 1, 1, ..., 71.2833, 'C85', 'C'],
        [3, 1, 3, ..., 7.925, nan, 'S'],
        ...,
        [444, 1, 2, ..., 13.0, nan, 'S'],
        [445, 1, 3, ..., 8.1125, nan, 'S'],
        [446, 1, 1, ..., 81.8583, 'A34', 'S']], dtype=object),
 array([[447, 1, 2, ..., 19.5, nan, 'S'],
        [448, 1, 1, ..., 26.55, nan, 'S'],
        [449, 1, 3, ..., 19.2583, nan, 'C'],
        ...,
        [889, 0, 3, ..., 23.45, nan, 'S'],
        [890, 1, 1, ..., 30.0, 'C148', 'C'],
        [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)]